-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 22, 2024 at 05:45 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `database`
--

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `userid` int(11) NOT NULL,
  `First_name` varchar(255) NOT NULL,
  `Last_name` varchar(255) NOT NULL,
  `class_id` int(255) NOT NULL,
  `email` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`userid`, `First_name`, `Last_name`, `class_id`, `email`) VALUES
(39184, 'กฤติน', 'ลิ้มสวรรค์', 111, '39184@bpk.ac.th'),
(39185, 'กันตภณ', 'เอื้อจิตร', 111, '39185@bpk.ac.th'),
(39186, 'ธีรเมธ', 'ชอบหาญ', 111, '39186@bpk.ac.th'),
(39188, 'ชินภัทร', 'มนตรี', 111, '39188@bpk.ac.th'),
(39189, 'ญาณวุฒิ', 'บรรหารสกุล', 111, '39189@bpk.ac.th'),
(39190, 'วัชรมงคล', 'โพธิ์แสงดา', 111, '39190@bpk.ac.th'),
(39191, 'ทัยสันต์', 'สิริกชกร', 111, '39191@bpk.ac.th'),
(39192, 'ธนพัต', 'รุ่งเรืองสาร', 111, '39192@bpk.ac.th'),
(39193, 'ธรรณธร', 'สงแจ้ง', 111, '39193@bpk.ac.th'),
(39194, 'ธัญวรัตน์', 'วิทยกุล', 111, '39194@bpk.ac.th'),
(39195, 'ปรกบุญ', 'ขลุ่ยแก้ว', 111, '39195@bpk.ac.th'),
(39196, 'พุฒิพงศ์', 'ภูทองบ่อ', 111, '39196@bpk.ac.th'),
(39197, 'ภูเดชา', 'พรมเรือน', 111, '39197@bpk.ac.th'),
(39198, 'วชิรวิทย์', 'ตั้งวัฒนะกุล', 111, '39198@bpk.ac.th'),
(39199, 'อัณณ์อธิป', 'พงษ์จินดากร', 111, '39199@bpk.ac.th'),
(39200, 'อัศม์เดช', 'บุญญามิ่ง', 111, '39200@bpk.ac.th'),
(39206, 'ปภังกร', 'น้อยอิ่ม', 111, '39206@bpk.ac.th'),
(39209, 'ปณิธิ', 'ฝอยทอง', 111, '39209@bpk.ac.th'),
(39214, 'ณัทกร', 'วัฒนะภาราดา', 111, '39214@bpk.ac.th'),
(39219, 'กานต์เกล้า', 'คงนวล', 111, '39219@bpk.ac.th'),
(39187, 'บุญญาพร', 'ไพโรจน์ฤทธิ์กุล', 111, '39187@bpk.ac.th'),
(39201, 'กัลยรัตน์', 'ขวัญมาก', 111, '39201@bpk.ac.th'),
(39202, 'ขวัญหทัย', 'สาวเพชรดี', 111, '39202@bpk.ac.th'),
(39203, 'จารุมนวรรณ', 'บุญงามทวีทรัพย์', 111, '39203@bpk.ac.th'),
(39204, 'ชาลิสา', 'วิลัยวรรณ์', 111, '39204@bpk.ac.th'),
(39205, 'ญาดา', 'คำงาม', 111, '39205@bpk.ac.th'),
(39207, 'นภัสสร', 'วุ่นยรรยงค์', 111, '39207@bpk.ac.th'),
(39208, 'นันท์นภัส', 'นราพิริยานนท์', 111, '39208@bpk.ac.th'),
(39210, 'ณัฐนันท์', 'สีนา', 111, '39210@bpk.ac.th'),
(39211, 'ปวิชญา', 'บุญหลวง', 111, '39211@bpk.ac.th'),
(39212, 'ปัณฑารีย์', 'เจริญฤทธิ์', 111, '39212@bpk.ac.th'),
(39213, 'พริมดาสิริ', 'จันทร์ชิดฟ้า', 111, '39213@bpk.ac.th'),
(39215, 'ภภรกัญ', 'พาป้อ', 111, '39215@bpk.ac.th'),
(39216, 'ภัชชนก', 'อภินันทโชค', 111, '39216@bpk.ac.th'),
(39217, 'ศศิวิมล', 'ขันคำ', 111, '39217@bpk.ac.th'),
(39218, 'ปาณิสรา', 'นิตไธสง', 111, '39218@bpk.ac.th'),
(39184, 'กฤติน', 'ลิ้มสวรรค์', 111, '39184@bpk.ac.th'),
(39185, 'กันตภณ', 'เอื้อจิตร', 111, '39185@bpk.ac.th'),
(39186, 'ธีรเมธ', 'ชอบหาญ', 111, '39186@bpk.ac.th'),
(39188, 'ชินภัทร', 'มนตรี', 111, '39188@bpk.ac.th'),
(39189, 'ญาณวุฒิ', 'บรรหารสกุล', 111, '39189@bpk.ac.th'),
(39190, 'วัชรมงคล', 'โพธิ์แสงดา', 111, '39190@bpk.ac.th'),
(39191, 'ทัยสันต์', 'สิริกชกร', 111, '39191@bpk.ac.th'),
(39192, 'ธนพัต', 'รุ่งเรืองสาร', 111, '39192@bpk.ac.th'),
(39193, 'ธรรณธร', 'สงแจ้ง', 111, '39193@bpk.ac.th'),
(39194, 'ธัญวรัตน์', 'วิทยกุล', 111, '39194@bpk.ac.th'),
(39195, 'ปรกบุญ', 'ขลุ่ยแก้ว', 111, '39195@bpk.ac.th'),
(39196, 'พุฒิพงศ์', 'ภูทองบ่อ', 111, '39196@bpk.ac.th'),
(39197, 'ภูเดชา', 'พรมเรือน', 111, '39197@bpk.ac.th'),
(39198, 'วชิรวิทย์', 'ตั้งวัฒนะกุล', 111, '39198@bpk.ac.th'),
(39199, 'อัณณ์อธิป', 'พงษ์จินดากร', 111, '39199@bpk.ac.th'),
(39200, 'อัศม์เดช', 'บุญญามิ่ง', 111, '39200@bpk.ac.th'),
(39206, 'ปภังกร', 'น้อยอิ่ม', 111, '39206@bpk.ac.th'),
(39209, 'ปณิธิ', 'ฝอยทอง', 111, '39209@bpk.ac.th'),
(39214, 'ณัทกร', 'วัฒนะภาราดา', 111, '39214@bpk.ac.th'),
(39219, 'กานต์เกล้า', 'คงนวล', 111, '39219@bpk.ac.th'),
(39187, 'บุญญาพร', 'ไพโรจน์ฤทธิ์กุล', 111, '39187@bpk.ac.th'),
(39201, 'กัลยรัตน์', 'ขวัญมาก', 111, '39201@bpk.ac.th'),
(39202, 'ขวัญหทัย', 'สาวเพชรดี', 111, '39202@bpk.ac.th'),
(39203, 'จารุมนวรรณ', 'บุญงามทวีทรัพย์', 111, '39203@bpk.ac.th'),
(39204, 'ชาลิสา', 'วิลัยวรรณ์', 111, '39204@bpk.ac.th'),
(39205, 'ญาดา', 'คำงาม', 111, '39205@bpk.ac.th'),
(39207, 'นภัสสร', 'วุ่นยรรยงค์', 111, '39207@bpk.ac.th'),
(39208, 'นันท์นภัส', 'นราพิริยานนท์', 111, '39208@bpk.ac.th'),
(39210, 'ณัฐนันท์', 'สีนา', 111, '39210@bpk.ac.th'),
(39211, 'ปวิชญา', 'บุญหลวง', 111, '39211@bpk.ac.th'),
(39212, 'ปัณฑารีย์', 'เจริญฤทธิ์', 111, '39212@bpk.ac.th'),
(39213, 'พริมดาสิริ', 'จันทร์ชิดฟ้า', 111, '39213@bpk.ac.th'),
(39215, 'ภภรกัญ', 'พาป้อ', 111, '39215@bpk.ac.th'),
(39216, 'ภัชชนก', 'อภินันทโชค', 111, '39216@bpk.ac.th'),
(39217, 'ศศิวิมล', 'ขันคำ', 111, '39217@bpk.ac.th'),
(39218, 'ปาณิสรา', 'นิตไธสง', 111, '39218@bpk.ac.th'),
(39184, 'กฤติน', 'ลิ้มสวรรค์', 111, '39184@bpk.ac.th'),
(39185, 'กันตภณ', 'เอื้อจิตร', 111, '39185@bpk.ac.th'),
(39186, 'ธีรเมธ', 'ชอบหาญ', 111, '39186@bpk.ac.th'),
(39188, 'ชินภัทร', 'มนตรี', 111, '39188@bpk.ac.th'),
(39189, 'ญาณวุฒิ', 'บรรหารสกุล', 111, '39189@bpk.ac.th'),
(39190, 'วัชรมงคล', 'โพธิ์แสงดา', 111, '39190@bpk.ac.th'),
(39191, 'ทัยสันต์', 'สิริกชกร', 111, '39191@bpk.ac.th'),
(39192, 'ธนพัต', 'รุ่งเรืองสาร', 111, '39192@bpk.ac.th'),
(39193, 'ธรรณธร', 'สงแจ้ง', 111, '39193@bpk.ac.th'),
(39194, 'ธัญวรัตน์', 'วิทยกุล', 111, '39194@bpk.ac.th'),
(39195, 'ปรกบุญ', 'ขลุ่ยแก้ว', 111, '39195@bpk.ac.th'),
(39196, 'พุฒิพงศ์', 'ภูทองบ่อ', 111, '39196@bpk.ac.th'),
(39197, 'ภูเดชา', 'พรมเรือน', 111, '39197@bpk.ac.th'),
(39198, 'วชิรวิทย์', 'ตั้งวัฒนะกุล', 111, '39198@bpk.ac.th'),
(39199, 'อัณณ์อธิป', 'พงษ์จินดากร', 111, '39199@bpk.ac.th'),
(39200, 'อัศม์เดช', 'บุญญามิ่ง', 111, '39200@bpk.ac.th'),
(39206, 'ปภังกร', 'น้อยอิ่ม', 111, '39206@bpk.ac.th'),
(39209, 'ปณิธิ', 'ฝอยทอง', 111, '39209@bpk.ac.th'),
(39214, 'ณัทกร', 'วัฒนะภาราดา', 111, '39214@bpk.ac.th'),
(39219, 'กานต์เกล้า', 'คงนวล', 111, '39219@bpk.ac.th'),
(39187, 'บุญญาพร', 'ไพโรจน์ฤทธิ์กุล', 111, '39187@bpk.ac.th'),
(39201, 'กัลยรัตน์', 'ขวัญมาก', 111, '39201@bpk.ac.th'),
(39202, 'ขวัญหทัย', 'สาวเพชรดี', 111, '39202@bpk.ac.th'),
(39203, 'จารุมนวรรณ', 'บุญงามทวีทรัพย์', 111, '39203@bpk.ac.th'),
(39204, 'ชาลิสา', 'วิลัยวรรณ์', 111, '39204@bpk.ac.th'),
(39205, 'ญาดา', 'คำงาม', 111, '39205@bpk.ac.th'),
(39207, 'นภัสสร', 'วุ่นยรรยงค์', 111, '39207@bpk.ac.th'),
(39208, 'นันท์นภัส', 'นราพิริยานนท์', 111, '39208@bpk.ac.th'),
(39210, 'ณัฐนันท์', 'สีนา', 111, '39210@bpk.ac.th'),
(39211, 'ปวิชญา', 'บุญหลวง', 111, '39211@bpk.ac.th'),
(39212, 'ปัณฑารีย์', 'เจริญฤทธิ์', 111, '39212@bpk.ac.th'),
(39213, 'พริมดาสิริ', 'จันทร์ชิดฟ้า', 111, '39213@bpk.ac.th'),
(39215, 'ภภรกัญ', 'พาป้อ', 111, '39215@bpk.ac.th'),
(39216, 'ภัชชนก', 'อภินันทโชค', 111, '39216@bpk.ac.th'),
(39217, 'ศศิวิมล', 'ขันคำ', 111, '39217@bpk.ac.th'),
(39218, 'ปาณิสรา', 'นิตไธสง', 111, '39218@bpk.ac.th'),
(0, '', '', 0, ''),
(0, '', '', 0, ''),
(0, '', '', 0, ''),
(0, '', '', 0, ''),
(39220, 'ก้องภพ', 'รุ่งรัศมี', 112, '39220@bpk.ac.th'),
(39221, 'ก้องภพ', 'กองประมูล', 112, '39221@bpk.ac.th'),
(39222, 'กาญจน์ณวุฒิ', 'ไชยวงษ์', 112, '39222@bpk.ac.th'),
(39223, 'ชนุดม', 'สมฤทธิ์', 112, '39223@bpk.ac.th'),
(39224, 'ณัฐณพีร์', 'วิมานอมรแมน', 112, '39224@bpk.ac.th'),
(39226, 'ก้องภพ', 'ราชเจริญ', 112, '39226@bpk.ac.th'),
(39227, 'ทยากร', 'บุพอังกูร', 112, '39227@bpk.ac.th'),
(39229, 'พชรดนัย', 'น้อยสุทธิสกุล', 112, '39229@bpk.ac.th'),
(39230, 'พศิน', 'พลฉวี', 112, '39230@bpk.ac.th'),
(39231, 'เมธัส', 'เจียนกระโทก', 112, '39231@bpk.ac.th'),
(39232, 'วรพงศ์', 'กรรมจันทร์', 112, '39232@bpk.ac.th'),
(39233, 'ศิริวัฒน์', 'ศิริพานกุล', 112, '39233@bpk.ac.th'),
(39234, 'อธิวัฒน์', 'ประดับดี', 112, '39234@bpk.ac.th'),
(39235, 'อริย์ธัช', 'ชุมศรี', 112, '39235@bpk.ac.th'),
(39237, 'อัศวิน', 'สาโรวาท', 112, '39237@bpk.ac.th'),
(39244, 'ชินาธิป', 'กล่ำแสง', 112, '39244@bpk.ac.th'),
(39249, 'ธนวัสส์', 'อาภาประสิทธิ์', 112, '39249@bpk.ac.th'),
(39255, 'สหัติเธียร', 'จันทโสก', 112, '39255@bpk.ac.th'),
(39225, 'นิธินันท์', 'อริยะทวีพงษ์', 112, '39225@bpk.ac.th'),
(39228, 'ศรัณยวิทย์', 'ใหม่หะลา', 112, '39228@bpk.ac.th'),
(39236, 'กชพรรษ', 'ภทรปรีชาชัย', 112, '39236@bpk.ac.th'),
(39238, 'กานต์เกล้า', 'น้อยนาค', 112, '39238@bpk.ac.th'),
(39239, 'คีตภัทร', 'สายแก้ว', 112, '39239@bpk.ac.th'),
(39240, 'ณฐพร', 'ระดาพงษ์', 112, '39240@bpk.ac.th'),
(39241, 'นภสร', 'สังข์ทอง', 112, '39241@bpk.ac.th'),
(39242, 'บัณฑิตา', 'ศรีวิโรจน์', 112, '39242@bpk.ac.th'),
(39243, 'ปพิชญา', 'บัวเหม', 112, '39243@bpk.ac.th'),
(39245, 'ปุณณภา', 'สิงหดำรงกิจ', 112, '39245@bpk.ac.th'),
(39246, 'ปุณณิศา', 'สงวนศรี', 112, '39246@bpk.ac.th'),
(39247, 'พิชญาภา', 'อุดมศรี', 112, '39247@bpk.ac.th'),
(39248, 'ภัทรจารีย์', 'ดอกนาค', 112, '39248@bpk.ac.th'),
(39250, 'รัมภาชไม', 'รอดเรือง', 112, '39250@bpk.ac.th'),
(39251, 'ร่ำซำ', 'ฤกษ์อริยะ', 112, '39251@bpk.ac.th'),
(39252, 'รินรดา', 'เชื้อทอง', 112, '39252@bpk.ac.th'),
(39253, 'รินลดา', 'บัตรพันชนะ', 112, '39253@bpk.ac.th'),
(39254, 'ศิริชาดา', 'ศรีประพันธ์', 112, '39254@bpk.ac.th');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
